#!/bin/bash
#original script by http://combatwombat.7doves.com/2008/10/26/mysql-latin1-to-utf8-issues

for i in "$@" ; do
echo -n $i...
sed \
-e 's/=latin1/=utf8/g' \
-e 's/Î±/α/g' -e 's/Î²/β/g' -e 's/Î³/γ/g' -e 's/Î´/δ/g' \
-e 's/Îµ/ε/g' -e 's/Î¶/ζ/g' -e 's/Î·/η/g' -e 's/Î¸/θ/g' \
-e 's/Î¹/ι/g' -e 's/Îº/κ/g' -e 's/Î»/λ/g' -e 's/Î¼/μ/g' \
-e 's/Î½/ν/g' -e 's/Î¾/ξ/g' -e 's/Î¿/ο/g' -e 's/Ï€/π/g' \
-e 's/Ï/ρ/g' -e 's/Ïƒ/σ/g' -e 's/Ï„/τ/g' -e 's/Ï…/υ/g' \
-e 's/Ï†/φ/g' -e 's/Ï‡/χ/g' -e 's/Ïˆ/ψ/g' -e 's/Ï‰/ω/g' \
-e 's/Î‘/Α/g' -e 's/Î’/Β/g' -e 's/Î“/Γ/g' -e 's/Î”/Δ/g' \
-e 's/Î•/Ε/g' -e 's/Î–/Ζ/g' -e 's/Î—/Η/g' -e 's/Î˜/Θ/g' \
-e 's/Î™/Ι/g' -e 's/Îš/Κ/g' -e 's/Î›/Λ/g' -e 's/Îœ/Μ/g' \
-e 's/Î/Ν/g' -e 's/Îž/Ξ/g' -e 's/ÎŸ/Ο/g' -e 's/Î /Π/g' \
-e 's/Î¡/Ρ/g' -e 's/Î£/Σ/g' -e 's/Î¤/Τ/g' -e 's/Î¥/Υ/g' \
-e 's/Î¦/Φ/g' -e 's/Î§/Χ/g' -e 's/Î¨/Ψ/g' -e 's/Î©/Ω/g' \
-e 's/Î¬/ά/g' -e 's/Î­/έ/g' -e 's/Î®/ή/g' -e 's/Î¯/ί/g' \
-e 's/ÏŒ/ό/g' -e 's/Ï/ύ/g' -e 's/ÏŽ/ώ/g' -e 's/Î†/Ά/g' \
-e 's/Îˆ/Έ/g' -e 's/Î‰/Ή/g' -e 's/ÎŠ/Ί/g' -e 's/ÎŒ/Ό/g' \
-e 's/ÎŽ/Ύ/g' -e 's/Î/Ώ/g' -e 's/Ï‹/ϋ/g' -e 's/Î°/υ/g' \
-e 's/ÏŠ/ϊ/g' -e 's/Î/ι/g' -e 's/Ï‚/ς/g' \
-e 's/Ã©/é/g' -e 's/Ã¨/è/g' -e 's/Ãª/ê/g' -e 's/Ã«/ë/g' \
-e 's/Â / /g' -e 's/Â«/«/g' -e 's/Â»/»/g' -e 's/Â°/°/g' \
-e 's/Ã¤/ä/g' -e 's/Ã¢/â/g' -e 's/Ã®/î/g' -e 's/Â/’/g' \
-e 's/Ã¯/ï/g' -e 's/Ã¬/ì/g' -e 's/Ã²/ò/g' -e 's/Ã´/ô/g' \
-e 's/Ã¶/ö/g' -e 's/Ã¿/ÿ/g' -e 's/Ã¹/ù/g' -e 's/Ã¼/ü/g' \
-e 's/Ã»/û/g' -e 's/Ã§/ç/g' -e 's/Ã‰/É/g' -e 's/Ãˆ/È/g' \
-e 's/ÃŠ/Ê/g' -e 's/Ã‹/Ë/g' -e 's/Ã€/À/g' -e 's/Ã„/Ä/g' \
-e 's/Ã‚/Â/g' -e 's/Ãž/Î/g' -e 's/Ã�/Ï/g' -e 's/ÃŒ/Ì/g' \
-e 's/Ã’/Ò/g' -e 's/Ã”/Ô/g' -e 's/Ã–/Ö/g' -e 's/Å¸/Ÿ/g' \
-e 's/â€¦/…/g' -e 's/â€™/’/g' -e 's/àƒâ‚¬/ä/g' -e 's/â€˜//g' \
-e 's/â€œ/“/g' -e 's/â€�/”/g' -e 's/â€¹/‹/g' -e 's/â€º/›/g' \
-e 's/â€”/—/g' -e 's/â€“/—/g' -e 's/â€?/”/g' -e 's/àƒ’/à/g' \
-e 's/â’€’™/’/g' -e 's/â’€’œ/“/g' -e 's/â’€?/”/g' -e 's/àƒ’©/é/g' \
-e 's/â’€’¦//g' -e 's/â€“/\•/g' -e 's/â‚¬/€/g' \
-e 's/Ã™/Ù/g' -e 's/Ãœ/Ü/g' -e 's/Ã›/Û/g' -e 's/Ã‡/Ç/g' $i|
sed -e 's/Ã/à/g' > $i.clean

echo done
done

